** have you got everything in order?

clojure and overtone installed and up and running with a MIDI controller connected?

[[file:README.org][file:~/repos/granularite/README.org]]

No? [[file:README.org::*sound test][sound test]]

#+begin_src clojure
(demo 10 (sin-osc (abs  (* 10000 (brown-noise:kr)))))
#+end_src

#+RESULTS:
: #<synth-node[loading]: granularite.cf44/audition-synth 33>

#+begin_src clojure
(stop)
#+end_src

#+RESULTS:

** make changes to the basic synth

#+begin_src clojure
(ctl line-for-variation1  :trate 0.3 :dur-numerator 12)
#+end_src

#+RESULTS:
: #<synth-node[live]: granularif44/tgrains-line-synth 40>




*** code blocks

Slightly updated, on the way to being renamed "updated"

#+begin_src clojure
    (defn mini-scaling-test [active-synth double-colon-name]
      (on-event
       [:midi :control-change]
       (fn [{cc-channel :note vel :velocity}]
	 (case cc-channel

	   16 (do (reset! offset-ones (* 1 (scale-range vel 1 127 0 99)))
		  (reset! offset (+ @offset-ones @offset-tens @offset-hundreds))
		  (test active-synth :cc36 @offset (+ @offset @ranger) vel))
	   17 (do (reset! offset-tens (* 10 (scale-range vel 1 127 0 99)))
		  (reset! offset (+ @offset-ones @offset-tens @offset-hundreds))
		  (test active-synth :cc36 @offset (+ @offset @ranger) vel))
	   18 (do (reset! offset-hundreds (* 100 (scale-range vel 1 127 0 99)))
		  (reset! offset (+ @offset-ones @offset-tens @offset-hundreds))
		  (test active-synth :cc36 @offset (+ @offset @ranger) vel))

	   20 (do (reset! ranger-ones (* 1 (scale-range vel 1 127 0 99)))
		  (reset! ranger (+ @ranger-ones @ranger-tens @ranger-hundreds))
		  (test active-synth :cc36 @offset (+ @offset @ranger) vel))
	   21 (do (reset! ranger-tens (* 10 (scale-range vel 1 127 0 99)))
		  (reset! ranger (+ @ranger-ones @ranger-tens @ranger-hundreds))
		  (test active-synth :cc36 @offset (+ @offset @ranger) vel))
	   22 (do (reset! ranger-hundreds (* 100 (scale-range vel 1 127 0 99)))
		  (reset! ranger (+ @ranger-ones @ranger-tens @ranger-hundreds))
		  (test active-synth :cc36 @offset (+ @offset @ranger) vel))
	   34 (ctl active-synth :cc34 (scale-range vel 1 127 0.1 10))
	   35 (ctl active-synth :cc35 (scale-range vel 1 127 1 24))
	   36 (ctl active-synth :cc36 (scale-range vel 1 127 @offset (+ @offset @ranger)))
	   37 (ctl active-synth :cc37 (scale-range vel 1 127 0 1))
	   41 (ctl active-synth :cc41 (scale-range vel 1 127 0.01 1))
	   ))
       double-colon-name))

#+end_src

#+RESULTS:
: #'granularite.core/mini-scaling-test

*** actually call the event-handler

#+BEGIN_SRC clojure :results silent
(mini-scaling-test obessive ::mini-obsess)
#+END_SRC

Make significantly louder with cc37!
#+begin_src clojure
(ctl obessive :cc37 10)
#+end_src

#+RESULTS:
: #<synth-node[live]: graf44/minirand-ccgrain-no-line 48>

use the "two-hand" handler, with the envelope knobs ordered from smallest to greatest
- start with using VCO1 shape AND 
  - amp EGs affect startpoint cc36 (centerpos) aka "offset"
  - EGs affect "distance from startpoint" aka "ranger"


*** kill the hander: mini-obsess
#+BEGIN_SRC clojure :results silent
(remove-event-handler ::mini-obsess)
;; (remove-event-handler ::obess)
#+END_SRC



#+RESULTS:
: #<synth-node[live]: graf44/minirand-ccgrain-no-line 48>

*** use a whole different audio file (elec. piano)

My "mono sounds" for use of mono converted files

[[file:~/Documents/sounds/][file:~/Documents/sounds/]]

#+begin_src clojure
(def pianos (load-sample (str path-to-sounds "Classic Electric Piano_bip.6.L.aif")))
#+end_src

#+RESULTS:
: #'granularite.core/pianos

#+begin_src clojure
(def obessive (minirand-ccgrain-no-line 3))
#+end_src

#+RESULTS:
: #'granularite.core/obessive

*** use larger "homemade" SY-style piano file

#+begin_src clojure
(def pianos2 (load-sample (str path-to-sounds "strange-MONO2.aif")))
#+end_src

#+RESULTS:
: #'granularite.core/pianos2

#+begin_src clojure
(def obessive (minirand-ccgrain-no-line 4))
#+end_src

#+RESULTS:
: #'granularite.core/obessive

Recall or rename the handler?
#+BEGIN_SRC clojure :results silent
(mini-scaling-test obessive ::mini-obsess)
#+END_SRC


#+begin_src clojure
(ctl obessive :cc37 10)
#+end_src

*** new block tries to involve 24 (LFO Rate) for amplitude

#+begin_src clojure
  (defn update-mini-scaling-test [active-synth double-colon-name]
    (on-event
     [:midi :control-change]
     (fn [{cc-channel :note vel :velocity}]
       (case cc-channel

	 16 (do (reset! offset-ones (* 1 (scale-range vel 1 127 0 99)))
		(reset! offset (+ @offset-ones @offset-tens @offset-hundreds))
		(test active-synth :cc36 @offset (+ @offset @ranger) vel))
	 17 (do (reset! offset-tens (* 10 (scale-range vel 1 127 0 99)))
		(reset! offset (+ @offset-ones @offset-tens @offset-hundreds))
		(test active-synth :cc36 @offset (+ @offset @ranger) vel))
	 18 (do (reset! offset-hundreds (* 100 (scale-range vel 1 127 0 99)))
		(reset! offset (+ @offset-ones @offset-tens @offset-hundreds))
		(test active-synth :cc36 @offset (+ @offset @ranger) vel))

	 20 (do (reset! ranger-ones (* 1 (scale-range vel 1 127 0 99)))
		(reset! ranger (+ @ranger-ones @ranger-tens @ranger-hundreds))
		(test active-synth :cc36 @offset (+ @offset @ranger) vel))
	 21 (do (reset! ranger-tens (* 10 (scale-range vel 1 127 0 99)))
		(reset! ranger (+ @ranger-ones @ranger-tens @ranger-hundreds))
		(test active-synth :cc36 @offset (+ @offset @ranger) vel))
	 22 (do (reset! ranger-hundreds (* 100 (scale-range vel 1 127 0 99)))
		(reset! ranger (+ @ranger-ones @ranger-tens @ranger-hundreds))
		(test active-synth :cc36 @offset (+ @offset @ranger) vel))
	 34 (ctl active-synth :cc34 (scale-range vel 1 127 0.1 10))
	 35 (ctl active-synth :cc35 (scale-range vel 1 127 1 24))
	 36 (ctl active-synth :cc36 (scale-range vel 1 127 @offset (+ @offset @ranger)))
	 37 (ctl active-synth :cc37 (scale-range vel 1 127 0 @amp-offset))
	 24 (do (reset! amp-range (* 2 (scale-range vel 1 127 0 1)))
		(reset! amp-offset (+ @amp-range 10))
		(ctl active-synth :cc37 @amp-offset))

	 ;; (ctl active-synth :cc37 (scale-range vel 1 127 0 1))

	 41 (ctl active-synth :cc41 (scale-range vel 1 127 0.01 1))
	 ))
     double-colon-name))
#+end_src

#+RESULTS:
: #'granularite.core/update-mini-scaling-test

#+BEGIN_SRC clojure :results silent
(update-mini-scaling-test obessive ::update-mini-obsess)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(remove-event-handler ::update-mini-obsess)
;; (remove-event-handler ::obess)
#+END_SRC

* helpful ~pprint~ documentation of your buffers

#+begin_src clojure :results output
  (for [name [variation1 variation3 variation4]]
    (do  (pprint name) (println)))
#+end_src

#+RESULTS:
#+begin_example
{:id 0,
 :size 1323000,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@3d0d43e1: :live>,
 :path "/Users/oi/Documents/sounds/brown30-mono.wav",
 :args {},
 :name "brown30-mono.wav",
 :rate-scale 1.0,
 :duration 30.0,
 :n-samples 1323000}

{:id 1,
 :size 916417,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@6b27d58d: :live>,
 :path
 "/Users/oi/Documents/sounds/SHORT-slow-Indian-dulcimer-MONO.wav",
 :args {},
 :name "SHORT-slow-Indian-dulcimer-MONO.wav",
 :rate-scale 1.0,
 :duration 20.780430839002268,
 :n-samples 916417}

{:id 2,
 :size 1218206,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@6b053255: :live>,
 :path
 "/Users/oi/Documents/sounds/30seconds-slow-Indian-dulcimer-MONO.wav",
 :args {},
 :name "30seconds-slow-Indian-dulcimer-MONO.wav",
 :rate-scale 1.0,
 :duration 27.62371882086168,
 :n-samples 1218206}

#+end_example
